[
    {
        "author": "jakeyonthecouch",
        "text": "I've seen some people (like zero punctuation) describe this game as a DLC.I can see why people would think that at first glance, but this game is so much further from that. It builds on BotW in almost every way.The shrines are better, the puzzles are fantastic; they're in a nice sweet spot of diffculty where they're not offensively easy, but don't have you bashing your joycons against your head. The new set of abilities you have lend themselves better to the shrine puzzles.There's more enemy variety, which was a major failing of botw (which I still thought was a decent game)there's so many fun enemies in this game. I love the constructs, the bosses are better than botw. the last boss is better than botw, (if you did all of the temples in botw, the final boss was piss easy. this game definitely rectified that)One thing I love about this game is that in an era where almost every game is dedicated to holding your hand as much as possible, this one isn't afraid to just leave you to it.the Zonai devices give you this fantastic buffer for if you're scratching your head over something. There's always a way the devs intend you to do something, but you can always be like 'ah fuck it' and slap something together that launches you halfway across the map.I played this a good few months after it came out and i'm so glad nothing got spoiled for me because the natural way I discovered the main plot and some of the core elements of the game was fantastic.The game really nails the vibe of 'huh, I wonder if this dumbass idea will work' and then it does and you slap your knee and do a silly laugh.My only real complaint is that the depths felt a bit lacking and half the time I didn't really enjoy exploring them.I honestly groan at open world games these days, but this was a pleasure to play through. I put in 105 hours all in all.Will definitely go back in for a second playthrough in another decade or so.9/10Read more...",
        "date": "Nov 1, 2023"
    },
    {
        "author": "Vjfoy25",
        "text": "Bwst zelda game and you can do whatever you want in it",
        "date": "Oct 27, 2023"
    },
    {
        "author": "Ivan Karmanov",
        "text": "+ Major improvements with weapon and arrows. Fuze mechanics solved arrows and weapon search+ Caves are great. Treasure hunting is interesting with all these armour sets+ Connection between under-earth and earth is great.+ Sky islands with shrines give great travel speed+ Nice thing with dragons+ Ascend is as useful as glider, awesome addition- Ultrahand was not so useful. Balloon with glide is the most convenient.- Cooking is kinda boring. At first more interesting, at the endgame boring- Boss fights sometimes are not challenging (Gannon)- Under-earth is mostly boring to explore- I want to keep playing after the boss fight",
        "date": "Oct 12, 2023"
    },
    {
        "author": "Pavel Vasilev",
        "text": "The game is great, but the ending was disappointing. Although we all understand that the princess will be saved))))",
        "date": "Aug 1, 2023"
    },
    {
        "author": "Pablo Carretero Garcia",
        "text": "One of the best zelda games i´ve ever played. Better than botw in almost every aspect. That ending was breathtaking",
        "date": "Jul 11, 2023"
    },
    {
        "author": "VP",
        "text": "A flawed but fun experience I can easily recommend for those who played Breath of the Wild and liked it. Because this is BotW, just more of it. I liked my playthrough a lot despite my gripes with the story. I did, almost 200 hours and probably will casually be on and off the game to collect/complete everything.SPOILER WARNING:The story, while more engaging and seems to be more involved than BotW's, it's retconned to hell and back and there are a lot of glaring issues. Some that BotW had and some new ones due to the retcons/inconsistencies with continuity from BotW which is bothersome. some NPCs from BotW act like they are meeting Link for the first time and it's insane imo I don't understand why some have amnesia lol This is not just with side quest characters but some main story ones too like Robbie. He literally works with you to improve the Sheika slate (which is oddly enough missing from this game and no one has anything to say about it, the purah pad replacing it).Also, not sure why anything from the Calamity is just gone. It's been years but you see zero debris from anything from the first game. Not even in places I doubt people went to clean up. Sheika lore seems to be completely revamped as well hence the missing ancient tech while Zonia tech seems to take its place. They spent an entire game establishing a lot of world building just to retcon it with TotK. I'm just curious af as to why they did it. Even where Link is revived in BotW (an integral part to this world's stat of affairs) you see no evidence of that tech in TotK. Barely ruins. This was a strange decision to just remove a lot of BotW's lore with zero explanation.I also wish the mystery with Zelda wasn't so predictable and the characters were kind of dumb about it in a contrived way. The one character that saw through fake Zelda's antics ironically gets killed. The past is also woefully underused, only seen through Zelda's memories and paints Hyrule as an all good nation when the first king seem kind of tyranical. There's a lot of grey in the way the story is told but it forces a black/white narrative which is an injustice to the intriguing set up.Ganon is also kind of one note when the kind of story TotT is telling they had room to explore his character. Zelda seems to be subdued from her personality in the first game and Link, while very expressive in the opening scene, never expresses that level of expression again. He so stoic and unfeeling it's jarring to see characters that like him  a lot interact with him because he doesn't seem mentally there or that he cares. I wish they let him express himself more with body language and facial expressions.This game also has the same issue BotW had with storytelling. Not enough and if you go ahead of the story via gameplay the game outright skips missions integral to the plot. No warning or anything. No way to get to play these missions out either, once missed they are missed.  While BotW is less affected by the open world/freedom aspect of gameplay TotK could've benefited from a more linear approach imo. Maybe lock off areas/progression that affects story progression idk, anything than what it is now lolThe gameplay is good, more BotW but with improvements in some areas. Nintendo went in the right direction and fuse makes breakable weapons more fun since we have to still deal with them. Still an issue with storage and the solution they give (sutom home from a side quest) helps with that it's executed poorly with harsh limitations (only 15 rooms at a time, hoping for an expansion with updates).A lot of issues BotW had in gameplay are honestly still present in this game but they applied the bandaid approach with some of them (example how they respond to slipping is with food and an outfit). It works in some ways but doesn't in others.There's way more stuff but this site has a character limit lol Still, I enjoyed the game a lot. I just wish the story lived up to the improvement of other things. I still recommend it.Read more...",
        "date": "Jun 18, 2023"
    },
    {
        "author": "PaulaHub",
        "text": "🍓I play a new s​ех game 1​8​+​) I can not get through it, very hard) Who played, help me ➤https://ssur.cc/seuhub",
        "date": "May 17, 2023"
    },
    {
        "author": "HuibFG",
        "text": "Digital Foundry mentioned something about current Nintendo management wanting to play it safe and Tears of the Kingdom fits perfectly with that description: it combines the best-selling Zelda game with a building system akin to that of Minecraft or Fortnite. If you want, you can have a wonderful experience with Tears of the Kingdom, but it is not for me.The gameplay is identical to that of Breath of the Wild, as are the story, the visuals, the sound design and the music, aside from a few minor tweaks. This means that the things that were new, fresh and cool in BotW are now an uninspired rehash of old ideas, and the things that were annoying are now immensely grating and show a complete lack of intent to improve upon older titles.Tears of the Kingdom is the amazing DLC that the Wii U’s Breath of the Wild should have had, except that it comes five years too late and that Nintendo is selling it as if it were a new game for the Switch.",
        "date": "May 16, 2023"
    },
    {
        "author": "lukas R",
        "text": "it good",
        "date": "Jun 9, 2022"
    }
]